# Student Outcomes

## Part 1: Data Acquisition

In [1]:
# Import modules

import mysql.connector

import numpy as np

import pandas as pd

The motivation for commencing the H.Dip programme was to determine how to merge datasets with a common linking key/index e.g. student ID, and conduct analysis on this merged dataset, as this reflects the analysis carried out in my everyday research (medical education in an Irish postgraduate medical training body). Previously, a statistician was employed to assist with this work as the volumes of data were too large conventional stats packages, and ever since I have wanted to be able to do this myself, to allow me to complete all stages of my research myself, from planning, execution, data gathering and analysis.  
Therefore, this project aims to simulate a student outcomes research project, including the merging of data by key identifier, the use of SQL database to hold the data, analysis through python packages and presentation through similar. 
After some research, the following 2 datasets were identified for use in this project, as they were relatively similar to the data I wsa dealing with in my previous work:  
1. https://www.kaggle.com/datasets/pratikprasad18/student-records
2. https://www.kaggle.com/datasets/mahmoudelhemaly/students-grading-dataset

Prior to commencing the project, the files were downloaded as csvs to the desktop to examine the possibility of merging columns through the student ID. 

- Issues for this project:

The student records database contains student records for 10000 students. The student performance and behavior dataset contains 5000. To enable matching, student ids were replaced from #1 to 5000 and #1 to 10000, respectively. The other steps required for data clean-up could be completed in pandas

In [2]:
# Confirm the kernel is using the correct Python environment
import sys
sys.executable

'/home/codespace/.python/current/bin/python'

In [3]:
# Install SQLAlchemy and PyMySQL
# %pip in a codespace ensures packages are installed in the kernel's interpreter

%pip install sqlalchemy pymysql

Requirement already satisfied: sqlalchemy in /usr/local/python/3.12.1/lib/python3.12/site-packages (2.0.45)
Requirement already satisfied: pymysql in /usr/local/python/3.12.1/lib/python3.12/site-packages (1.1.2)
Requirement already satisfied: greenlet>=1 in /usr/local/python/3.12.1/lib/python3.12/site-packages (from sqlalchemy) (3.3.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /home/codespace/.local/lib/python3.12/site-packages (from sqlalchemy) (4.15.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import sqlalchemy
import pymysql

### END

In [5]:
# Test the import
import sqlalchemy
import pymysql
import sys
print(sys.executable)
print(sqlalchemy.__version__)

/home/codespace/.python/current/bin/python
2.0.45

In [6]:
# Create a SQLAlchemy engine to connect to MySQL

from sqlalchemy import create_engine

# Replace credentials with your docker-compose settings
engine = create_engine(
    "mysql+pymysql://analyst:analystpassword@localhost:3306/analytics_db"
)

In [7]:
# Install crytography so PyMySQL can handle MySQL 8’s default authentication
%pip install cryptography sqlalchemy pymysql --upgrade

Requirement already satisfied: cryptography in /usr/local/python/3.12.1/lib/python3.12/site-packages (46.0.3)
Requirement already satisfied: sqlalchemy in /usr/local/python/3.12.1/lib/python3.12/site-packages (2.0.45)
Requirement already satisfied: pymysql in /usr/local/python/3.12.1/lib/python3.12/site-packages (1.1.2)
Requirement already satisfied: cffi>=2.0.0 in /home/codespace/.local/lib/python3.12/site-packages (from cryptography) (2.0.0)
Requirement already satisfied: greenlet>=1 in /usr/local/python/3.12.1/lib/python3.12/site-packages (from sqlalchemy) (3.3.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /home/codespace/.local/lib/python3.12/site-packages (from sqlalchemy) (4.15.0)
Requirement already satisfied: pycparser in /home/codespace/.local/lib/python3.12/site-packages (from cffi>=2.0.0->cryptography) (2.23)
Note: you may need to restart the kernel to use updated packages.

In [8]:
# Test the connection
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine(
    "mysql+pymysql://analyst:analystpassword@127.0.0.1:3306/students"
)

query = "SELECT * FROM merged_students LIMIT 5"
df = pd.read_sql(query, engine)

# Show the DataFrame
df

,StudentID,Attendance_Percent,Gender,Age,Department,Midterm_Score,Final_Score,Projects_Score,Total_Score,Extracurricular_Activities,Parent_Education_Level,Family_Income_Level
0,S10000,61.70,Female,22,Mathematics,40.61,59.61,62.84,59.8865,Yes,Master's,Medium
1,S10001,69.78,Male,18,Business,57.27,74.00,98.23,81.9170,No,High School,Low
2,S10002,71.95,Male,24,Engineering,41.84,63.85,91.22,67.7170,Yes,High School,Low
3,S10003,81.31,Female,24,Engineering,45.65,44.44,55.48,51.6535,No,High School,Low
4,S10004,81.37,Female,23,CS,53.13,61.77,87.43,71.4030,Yes,Master's,Medium

All of above conversation: https://chatgpt.com/share/695c51ca-c5d4-800d-91fb-ac7140f42fc6

tidy up code with last bit of code it gave.

## Analysis

The following analysis will determine:  
a) Descriptive statistics:  
- The total number of students in the dataset,  
- The number of males and females in the dataset,  
- The average age of all students,  
- The average age for males and females,  
- The average Total Score,   
- The average Total Score for males and for females,  
- The sum of students in each department,    
- Average attendance for all students,  
- Average attendance for males and females,

b) Determining relationships between variables  
- Investigation for relationships between variables (including, attendance, sex, project score, midterm score) and final scorem  

c) Exploring Variance
- MANOVA

PCA?

In [9]:
# Total number of students in the dataset

total_students_query = "SELECT COUNT(*) AS total_students FROM merged_students"
total_students_df = pd.read_sql(total_students_query, engine)   
total_students_df

   total_students
0            5000

In [10]:
# Number of males in the dataset

total_males_query = "SELECT COUNT(*) AS total_males FROM merged_students WHERE gender = 'Male'"
total_males_df = pd.read_sql(total_males_query, engine)
total_males_df

   total_males
0         2551

In [11]:
# Total number of females in the dataset
total_females_query = "SELECT COUNT(*) AS total_females FROM merged_students WHERE gender = 'Female'"
total_females_df = pd.read_sql(total_females_query, engine)
total_females_df

   total_females
0           2449

In [12]:
# Average age of all students
average_age_query = "SELECT AVG(age) AS average_age FROM merged_students"
average_age_df = pd.read_sql(average_age_query, engine)
average_age_df

   average_age
0      21.0484

In [13]:
# Average age of males in the dataset
average_male_age_query = "SELECT AVG(age) AS average_male_age FROM merged_students WHERE gender = 'Male'"
average_male_age_df = pd.read_sql(average_male_age_query, engine)
average_male_age_df

   average_male_age
0           21.0216

In [14]:
# Average age of females in the dataset
average_female_age_query = "SELECT AVG(age) AS average_female_age FROM merged_students WHERE gender = 'Female'"
average_female_age_df = pd.read_sql(average_female_age_query, engine)   
average_female_age_df

   average_female_age
0             21.0764

In [15]:
# The average total score of all students
average_score_query = "SELECT AVG(total_score) AS average_total_score FROM merged_students"
average_score_df = pd.read_sql(average_score_query, engine)
average_score_df

   average_total_score
0            71.592557

In [16]:
# Total average score for males
average_male_score_query = "SELECT AVG(total_score) AS average_male_score FROM merged_students WHERE gender = 'Male'"
average_male_score_df = pd.read_sql(average_male_score_query, engine)
average_male_score_df

   average_male_score
0           71.597466

In [17]:
# Average total score for females
average_female_score_query = "SELECT AVG(total_score) AS average_female_score FROM merged_students WHERE gender = 'Female'"
average_female_score_df = pd.read_sql(average_female_score_query, engine)
average_female_score_df

   average_female_score
0             71.587444

In [18]:
# Count for each department
department_count_query = "SELECT department, COUNT(*) AS student_count FROM merged_students GROUP BY department"
department_count_df = pd.read_sql(department_count_query, engine)
department_count_df

    department  student_count
0  Mathematics           1223
1     Business           1264
2  Engineering           1274
3           CS           1238
4                           1

In [19]:
# Average attendance rate for all students
average_attendance_query = "SELECT AVG(Attendance_Percent) AS average_attendance_percent FROM merged_students"
average_attendance_df = pd.read_sql(average_attendance_query, engine)
average_attendance_df

   average_attendance_percent
0                   79.852262

In [20]:
# Average attendance rate by department
average_attendance_query = "SELECT department, AVG(Attendance_Percent) AS average_attendance_percent FROM merged_students GROUP BY department"
average_attendance_df = pd.read_sql(average_attendance_query, engine)
average_attendance_df

    department  average_attendance_percent
0  Mathematics                   80.145184
1     Business                   79.774683
2  Engineering                   80.098760
3           CS                   79.397674
4                                68.410004

In [21]:
# Multivariate analysis: Average total score by department and gender
average_score_by_dept       = """
SELECT department, gender, AVG(total_score) AS average_total_score
FROM merged_students
GROUP BY department, gender
"""
average_score_by_dept_df = pd.read_sql(average_score_by_dept, engine)
average_score_by_dept_df

    department  gender  average_total_score
0  Mathematics  Female            71.640711
1     Business    Male            71.640507
2  Engineering    Male            71.824632
3  Engineering  Female            71.430752
4           CS  Female            71.437375
5  Mathematics    Male            71.462065
6     Business  Female            71.827372
7           CS    Male            71.436919
8               Female            67.687500

In [22]:
# Exploring relationship between attendance and total score
attendance_score_query = """
SELECT Attendance_Percent, total_score
FROM merged_students
WHERE Attendance_Percent IS NOT NULL AND total_score IS NOT NULL
"""
attendance_score_df = pd.read_sql(attendance_score_query, engine)
attendance_score_df

      Attendance_Percent  total_score
0                  61.70      59.8865
1                  69.78      81.9170
2                  71.95      67.7170
3                  81.31      51.6535
4                  81.37      71.4030
...                  ...          ...
4995               81.04      63.0560
4996               98.93      67.8980
4997               86.08      53.4250
4998               60.13      70.2715
4999               91.40      77.4230

[5000 rows x 2 columns]

In [25]:
query = """
SELECT Attendance_Percent, total_score
FROM merged_students
WHERE Attendance_Percent IS NOT NULL AND total_score IS NOT NULL
"""

df = pd.read_sql(query, engine)

correlation = df["Attendance_Percent"].corr(df["total_score"])
correlation

np.float64(0.0007278457569004974)

In [26]:
query = """
SELECT Age, total_score
FROM merged_students
WHERE Age IS NOT NULL AND total_score IS NOT NULL
"""

df = pd.read_sql(query, engine)

correlation = df["Age"].corr(df["total_score"])
correlation

np.float64(0.007099568471101763)

In [27]:
query = """
SELECT Midterm_Score, total_score
FROM merged_students
WHERE Midterm_Score IS NOT NULL AND total_score IS NOT NULL
"""

df = pd.read_sql(query, engine)

correlation = df["Midterm_Score"].corr(df["total_score"])
correlation

np.float64(0.31060174985519706)

In [28]:
query = """
SELECT Projects_Score, total_score
FROM merged_students
WHERE Projects_Score IS NOT NULL AND total_score IS NOT NULL
"""

df = pd.read_sql(query, engine)

correlation = df["Projects_Score"].corr(df["total_score"])
correlation

np.float64(0.5701005719652449)

Chat GPT: corr: https://chatgpt.com/share/695da3af-171c-800d-9e02-85f9fd44ea6a

In [35]:
pd.read_sql("DESCRIBE merged_students;", engine)

                         Field          Type Null Key Default Extra
0                    StudentID   varchar(20)   NO        None
1           Attendance_Percent         float  YES        None
2                       Gender   varchar(20)  YES        None
3                          Age           int  YES        None
4                   Department  varchar(150)  YES        None
5                Midterm_Score         float  YES        None
6                  Final_Score         float  YES        None
7               Projects_Score         float  YES        None
8                  Total_Score         float  YES        None
9   Extracurricular_Activities   varchar(10)  YES        None
10      Parent_Education_Level  varchar(100)  YES        None
11         Family_Income_Level   varchar(15)  YES        None

In [37]:
query = """
SELECT
    CASE
        WHEN Extracurricular_Activities = 'Yes' THEN 1
        WHEN Extracurricular_Activities = 'No' THEN 0
        ELSE NULL
    END AS extracurricular_numeric,
    total_score
FROM merged_students
WHERE total_score IS NOT NULL
  AND Extracurricular_Activities IN ('Yes', 'No');
"""

df = pd.read_sql(query, engine)

correlation = df["extracurricular_numeric"].corr(df["total_score"])
correlation

np.float64(-0.007096176465977008)

In [39]:
query = """
SELECT
    CASE
        WHEN Parent_Education_Level = 'Low' THEN 0
        WHEN Parent_Education_Level = 'Medium' THEN 1
        WHEN Parent_Education_Level = 'High' THEN 2
        ELSE NULL
    END AS parent_education_numeric,
    total_score
FROM merged_students
WHERE total_score IS NOT NULL
  AND Parent_Education_Level IN ('Low', 'Medium', 'High');
"""

df = pd.read_sql(query, engine)

correlation = df["parent_education_numeric"].corr(df["total_score"])
correlation

nan

Investigating ANOVA, MANOVA, PCA and regression for this dataset: https://chatgpt.com/share/695da4ed-0630-800d-8cf3-a2b2365f7869

# END